Big countries

In [2]:
import pandas as pd


data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    return world[["name", "population", "area"]].loc[(world["population"] > 25000000) | (world["area"] > 3000000)].set_index("name")
big_countries(world)

             population     area
name
Afghanistan    25500100   652230
Algeria        37100000  2381741

Recyclable and Low Fat Products

In [3]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})
orders

#def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    #if customers["id"] == orders["customerId"]:
       # customers.drop([customers["id"]])
    #return customers
orders['id'] = orders["customerId"]
merged = orders.merge(customers, how="outer")
result = merged[merged['customerId'].isna()].reset_index()
result.rename(columns={"name":"Customers"}, inplace=True)
result = result["Customers"].to_frame()
result

  Customers
0     Henry
1       Max

Article views 1

In [1]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})        

result = views[["author_id", "viewer_id"]].loc[views["author_id"] == views["viewer_id"]]
result.drop_duplicates(keep="first", inplace=True)
result.rename(columns={"author_id": "id"}, inplace=True)
result = result["id"].sort_values().to_frame()
result

NameError: name 'pd' is not defined

Invalid Tweets

In [5]:
data = [[1, 'Vote for Biden'], [2, 'Let us make America great again!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})
tweets[tweets["content"].str.len() > 15][["tweet_id"]]

   tweet_id
1         2

Calculate Special Bonus

In [6]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})
employees["bonus"] = employees.where((employees.employee_id % 2 != 0) & (employees.name.astype(str).str[0] != "M"))["salary"]
employees.fillna(0, inplace=True)

result = employees[["employee_id", "bonus"]].astype(int).sort_values(ascending=True, by="employee_id")
result

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

Fix Names in a Table

In [7]:
data = [[593 , 'Dalia'], [944, 'Freida'], [222, 'Refael']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})
users['name'] = users['name'].apply(lambda x: x.capitalize())
users.sort_values(by='user_id', inplace=True)

Find Users With Valid E-Mails

Solution number 1

In [8]:
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})
import re
def valid_email(x):
    
    pattern = r"^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode\.com$"
    x = "".join(x)
    if re.match(pattern, x):
        return x
    else:
        return False

users['mail'] = users['mail'].apply(valid_email)
result = users[users['mail'] != False]
result

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

Solution number 2

In [9]:
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    # Use the str.match() method with a regex pattern to find valid emails
    valid_emails_df = users[users['mail'].str.match(r'^[A-Za-z][A-Za-z0-9_\.\-]*@leetcode(\?com)?\.com$')]
    
    return valid_emails_df
print (valid_emails(users))

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

Patients With a Condition

In [10]:
data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})

def type_one(patients):
    return patients[patients["conditions"].str.contains(r'\bDIAB1\w+')]

type_one(patients)

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

Nth Highest Salary

In [11]:
data = [[1, 400], [2, 400], [3, 200]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'Int64', 'salary':'Int64'})

def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    column_name = f"getNthHighestSalary({N})"
    output = pd.DataFrame({column_name:[None]})
    result = employee.sort_values(by='salary', ascending=False)
    result = result.drop_duplicates(keep='first', subset=['salary'])


    if N == 0:
       output[column_name] = result.iloc[N,1]
       return output
    if N > len(result):
       return output
    else:
       output[column_name] = result.iloc[N-1,1]
       return output


nth_highest_salary(employee, 3)

  getNthHighestSalary(3)
0                   None

Second Highest Salary

In [12]:
data = [[1, 100], [2, 300], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
employee = employee.drop_duplicates(keep='first', subset=['salary'])
employee.sort_values(by='salary', ascending=False, inplace=True)
if employee['salary'].shape[0] >= 2:
    employee.loc[:, 'SecondHighestSalary'] = employee.iloc[1, 1]
else:
    employee.loc[:, 'SecondHighestSalary'] = None
employee.drop(columns=['id', 'salary'], axis='columns', inplace=True)
employee.drop_duplicates(keep='first', inplace=True)
employee

   SecondHighestSalary
1                  100

Department Highest Salary

In [13]:
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

max_salary = employee.groupby('departmentId')['salary'].transform('max')
result = employee[employee['salary'] == max_salary] 
result = result.rename(columns={'name':'Employee', 'salary':'Salary', 'departmentId':'Department'})
result['Department'] = result['Department'].astype(int)
result['Department'] = result['Department'].map(department.set_index('id')['name'])
result = result.iloc[:,1:].reset_index(drop=True)
result

  Employee  Salary Department
0      Jim   90000         IT
1    Henry   80000      Sales
2      Max   90000         IT

Department Top Three Salaries

Solution number 1

In [14]:
data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

def top_three_salaries(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
  if employee.empty or department.empty:
        return pd.DataFrame(columns=['Department','Employee', 'Salary'])
  no_dubl = employee.drop_duplicates(subset=['departmentId', 'salary'])
  no_dubl.set_index('name',inplace=True)
  no_dubl = no_dubl.groupby(['departmentId'])['salary'].apply(lambda x: x.sort_values(ascending=False).head(3)).reset_index()
  result = no_dubl.merge(employee, on=['departmentId', 'salary'])
  result.drop(columns=['name_x','id'], inplace=True)
  result = result.rename(columns={'departmentId':'Department', 'salary':'Salary', 'name_y':'Employee'})
  result['Department'] = result['Department'].astype(int)
  result['Department'] = result['Department'].map(department.set_index('id')['name'])
  result = result[['Department', 'Employee', 'Salary']]
  return result[['Department', 'Employee', 'Salary']]

Solution number 2

In [15]:
def top_three_salaries(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:

    top_salary = employee[employee.groupby('departmentId').salary.rank(method='dense', ascending=False) <= 3]

    employee_department = top_salary.merge(department, left_on='departmentId', right_on='id')[['name_y', 'name_x', 'salary']]

    return employee_department.rename(columns = {'name_y': 'Department', 'name_x': 'Employee', 'salary': 'Salary'})

Rank Scores

In [16]:
data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})  
scores['rank'] = scores['score'].rank(ascending=False, method="dense")
scores = scores.astype({'rank':'Int64'})
scores.sort_values(by='rank', ascending=True, inplace=True)
scores.iloc[:,1:]

   score  rank
2    4.0     1
4    4.0     1
3   3.85     2
1   3.65     3
5   3.65     3
0    3.5     4

Delete Duplicate Emails

In [17]:
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})
person.set_index('id', inplace=True)
person.sort_values(by='id', inplace=True)
person.drop_duplicates(subset=['email'], keep='first', inplace=True)
person.reset_index(inplace=True)
person

   id             email
0   1  john@example.com
1   2   bob@example.com

Rearrange Products Table

In [18]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3'])
products['store2'].fillna(0, inplace=True)
result = pd.melt(products, id_vars=['product_id'], value_vars=['store1', 'store2', 'store3'], var_name='store', value_name='price')
result = result.loc[result['price'] != 0]

Count Salary Categories

In [19]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

accounts['category'] = pd.cut(x=accounts['income'], bins=[-float('inf'), 20000, 50001, float('inf')], right = False,, labels=['Low Salary', 'Average Salary', 'High Salary'],)
result = accounts.groupby(['category'], as_index=False).count()
result.rename(columns={'income':'accounts_count'}, inplace=True)
result.drop(columns=['account_id'], inplace=True)

SyntaxError: invalid syntax (1382866720.py, line 4)

Find Total Time Spent by Each Employee

In [ ]:
data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

result = employees.groupby(['event_day', 'emp_id'])[['in_time', 'out_time']].sum().assign(total_time = lambda x: x['out_time'] - x['in_time'])
result.reset_index(inplace=True)
result.rename(columns={'event_day': 'day'}, inplace=True)
result.drop(columns=['in_time', 'out_time'], inplace=True)
result.sort_values(by='total_time', ascending=False, inplace=True)
result

         day  emp_id  total_time
0 2020-11-28       1         173
2 2020-12-03       1          41
1 2020-11-28       2          30
3 2020-12-09       2          27

Game Play Analysis I

Solution number 1

In [ ]:
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

activity = activity.sort_values('event_date')
activity.drop_duplicates(subset=['player_id'], inplace=True)
activity.rename(columns={'event_date': 'first_login'}, inplace=True)
activity = activity.loc[:,  ['player_id','first_login']]
activity

   player_id first_login
0          1  2016-03-01
3          3  2016-03-02
2          2  2017-06-25

Solution number 2

In [ ]:
activity = activity.sort_values(by=['player_id', 'event_date'])
result = activity.groupby('player_id')['event_date'].min().reset_index()
result.rename(columns={'event_date': 'first_login'}, inplace=True)

Number of Unique Subjects Taught by Each Teacher

Solution number 1

In [ ]:
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})


result = teacher.sort_values(by=['teacher_id','subject_id'])
result.drop(columns=['dept_id'], inplace=True)
result.drop_duplicates(subset=['teacher_id','subject_id'], inplace=True)
result['cnt'] = result.groupby('teacher_id').transform('count')
result.drop(columns=['subject_id'], inplace=True)
result.drop_duplicates(subset=['teacher_id'], inplace=True)
result

   teacher_id  cnt
0           1    2
3           2    4

Solution number 2

In [ ]:
result = teacher.groupby('teacher_id')['subject_id'].nunique()
    
result = result.to_frame().reset_index()
result = result.rename(columns={'subject_id': 'cnt'})
result

   teacher_id  cnt
0           1    2
1           2    4

Classes More Than 5 Students

Solution number 1

In [ ]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})
classes = courses['class'].value_counts().reset_index()
classes = classes.loc[classes['count'] >= 5]
classes.drop(columns=['count'], inplace=True)
classes

  class
0  Math

Solution number 2

In [ ]:
courses = courses['class'].value_counts()[(courses['class'].value_counts()>4)].index.to_frame()
courses

      class
class
Math   Math

Customer Placing the Largest Number of Orders

Solution number 1

In [49]:
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

orders = orders['customer_number'].value_counts().to_frame()
result = orders[orders['count'] == orders['count'].max()].reset_index()
result = result.drop(columns=['count'])
result

   customer_number
0                3

Solution number 2

In [ ]:
def largest_orders(orders: pd.DataFrame) -> pd.DataFrame:
    return orders['customer_number'].mode().to_frame()

Group Sold Products By The Date

In [159]:
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})


result = activities.groupby(['sell_date'])['product'].agg([('num_sold', 'nunique'), ('products',lambda x: ','.join(sorted(x.unique())))]).reset_index()
result

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask

Daily Leads and Partners

In [168]:
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

result = daily_sales.groupby(['date_id', 'make_name']).nunique().reset_index()
result.rename(columns={'lead_id':'unique_leads', 'partner_id':'unique_partners'}, inplace=True)
result

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

Actors and Directors Who Cooperated At Least Three Times

Solution number 1

In [185]:
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

result = actor_director.groupby(['actor_id', 'director_id']).count().reset_index()
result = result.loc[result['timestamp'] >= 3].iloc[:,:2]
result

   actor_id  director_id
0         1            1

Solution number 2

In [ ]:
def actors_and_directors(actor_director: pd.DataFrame) -> pd.DataFrame:
    return actor_director.groupby(by=["actor_id", "director_id"], as_index=False).size().query("size >= 3").drop(labels="size", axis=1);

Replace Employee ID With The Unique Identifier

In [203]:
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees1 = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni1 = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

result = employees1.merge(employee_uni1, how='left').iloc[:,[2,1]]

result

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

Students and Examinations

In [243]:
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

df1 = students.merge(subjects, how='cross')

df2 = examinations.groupby(['student_id', 'subject_name']).agg(attended_exams=('subject_name', 'count')).reset_index()
result = df1.merge(df2, on=['student_id', 'subject_name'], how='left').sort_values(by=['student_id', 'subject_name'])
result.fillna(0).loc[:,['student_id', 'student_name', 'subject_name', 'attended_exams']]

    student_id student_name subject_name  attended_exams
0            1        Alice         Math             3.0
1            1        Alice      Physics             2.0
2            1        Alice  Programming             1.0
3            2          Bob         Math             1.0
4            2          Bob      Physics             0.0
5            2          Bob  Programming             1.0
9            6         Alex         Math             0.0
10           6         Alex      Physics             0.0
11           6         Alex  Programming             0.0
6           13         John         Math             1.0
7           13         John      Physics             1.0
8           13         John  Programming             1.0

Managers with at Least 5 Direct Reports

Solution number 1

In [311]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

result = employee.groupby(['managerId'])['id'].count().to_frame().reset_index()
result = result.query('id >= 5')
result['managerId'] = result['managerId'].map(employee.set_index('id')['name'])
result.rename(columns={'managerId':'name'}, inplace=True)
if result['name'].isnull().values.any():
    result = pd.DataFrame(columns=result.columns)
return result.iloc[:,[0]]

   name
0  John

Solution number 2

In [314]:
manager_report_count = employee.groupby('managerId').size().reset_index(name='directReports')
    
result = manager_report_count[manager_report_count['directReports'] >= 5]
    
result = result.merge(employee[['id', 'name']], left_on='managerId', right_on='id', how='inner')
    
result = result[['name']]

   managerId  directReports
0        101              5

Sales Person

In [350]:

data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})


df1 = company.merge(orders, left_on='com_id', right_on='com_id', how='inner')
df1 = df1[df1['name'] == 'RED']
result = sales_person.merge(df1, left_on='sales_id', right_on='sales_id', how='left')
result = result[pd.isna(result['com_id'])]
result.rename(columns={'name_x':'name'}, inplace=True)
result.loc[:,['name']]

   name
1   Amy
2  Mark
4  Alex

Beyond 30 days

Employees Earning More Than Their Managers

Solution number 1

In [372]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})
result = employee.merge(employee, left_on='id', right_on='managerId', how='right')
result = result[result['salary_y'] > result['salary_x']]
result.rename(columns={'name_y':'Employee'}, inplace=True)
result.loc[:,['Employee']]

  Employee
0      Joe

Solution number 2

In [1]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    result_df = employee[employee['salary'] > employee['managerId'].map(employee.set_index('id')['salary'])]
    result_df = result_df[['name']].rename(columns={'name': 'Employee'})
    return result_df

NameError: name 'pd' is not defined

Biggest Single Number

In [56]:
import numpy as np

data = [[8], [8], [4], [2], [3], [5], [1], [6]]
my_numbers = pd.DataFrame(data, columns=['num']).astype({'num':'Int64'})
my_numbers.drop_duplicates(keep=False, inplace=True)
my_numbers = my_numbers[my_numbers['num'] == my_numbers['num'].max()]
if my_numbers.empty:
    return pd.DataFrame({'num': [np.NaN]})
return my_numbers

   num
7    6

Not Boring Movies

In [78]:
data = [[1, 'War', 'great 3D', 8.9], [2, 'Science', 'fiction', 8.5], [3, 'irish', 'boring', 6.2], [4, 'Ice song', 'Fantacy', 8.6], [5, 'House card', 'Interesting', 9.1]]
cinema = pd.DataFrame(data, columns=['id', 'movie', 'description', 'rating']).astype({'id':'Int64', 'movie':'object', 'description':'object', 'rating':'Float64'})

cinema = cinema[cinema['description'] != 'boring']
cinema['id'] = cinema['id'].apply(lambda x: x if x % 2 != 0 else np.nan)
cinema.dropna(inplace=True)
cinema.sort_values(by='rating', ascending=False, inplace=True)
cinema

    id       movie  description  rating
4  5.0  House card  Interesting     9.1
0  1.0         War     great 3D     8.9

Product Sales Analysis I

In [10]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})

result = product.merge(sales, right_on='product_id', left_on='product_id', how='inner')
result.loc[:,['product_name', 'year', 'price']]

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

User Activity for the Past 30 Days I

In [66]:
data = [[1, 1, '2019-07-20', 'open_session'], [1, 1, '2019-07-20', 'scroll_down'], [1, 1, '2019-07-20', 'end_session'], [2, 4, '2019-07-20', 'open_session'], [2, 4, '2019-07-21', 'send_message'], [2, 4, '2019-07-21', 'end_session'], [3, 2, '2019-07-21', 'open_session'], [3, 2, '2019-07-21', 'send_message'], [3, 2, '2019-07-21', 'end_session'], [4, 3, '2019-06-25', 'open_session'], [4, 3, '2019-06-25', 'end_session']]
activity = pd.DataFrame(data, columns=['user_id', 'session_id', 'activity_date', 'activity_type']).astype({'user_id':'Int64', 'session_id':'Int64', 'activity_date':'datetime64[ns]', 'activity_type':'object'})

end_date = pd.to_datetime('2019-07-28')
start_date = end_date - pd.DateOffset(days=30)

activity = activity[(activity['activity_date'] >= start_date) & (activity['activity_date'] <= end_date)]
result = activity.groupby('activity_date')['user_id'].nunique().reset_index()
result = result.rename(columns={'activity_date':'day',
                                'user_id':'active_users'})
result

         day  active_users
0 2019-07-20             2
1 2019-07-21             2

Reformat Department Table

In [108]:
data = [[1, 8000, 'Jan'], [2, 9000, 'Jan'], [3, 10000, 'Feb'], [1, 7000, 'Feb'], [1, 6000, 'Mar']]
department = pd.DataFrame(data, columns=['id', 'revenue', 'month']).astype({'id':'Int64', 'revenue':'Int64', 'month':'object'})


def reformat_table(department: pd.DataFrame) -> pd.DataFrame:
    pivoted = department.pivot(index='id', columns='month', values='revenue')
    mon_names = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
    pivoted = pivoted.reindex(columns = mon_names)
    pivoted.rename(columns = lambda mon: mon + '_Revenue', inplace = True)
    return pivoted.reset_index()

month  id  Feb_Revenue  Jan_Revenue  Mar_Revenue
0       1         7000         8000         6000
1       2         <NA>         9000         <NA>
2       3        10000         <NA>         <NA>

Project Employees I

Solution 1

In [19]:
import numpy as np
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

result = project.merge(employee,
                       right_on='employee_id',
                       left_on='employee_id', how='inner')
result = result.groupby(['project_id'])['experience_years'].apply(np.mean).round(decimals=2).reset_index()
result = result.rename(columns={'experience_years':'average_years'})
result

   project_id  average_years
0           1            2.0
1           2            2.5

Rising Temperature

Solution 1

In [9]:
data = {
    'id': [1, 2, 3, 4, 5],
    'temperature': [20, 22, 18, 25, 19],
    'recordDate': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05']
}

def rising_temperature(weather: pd.DataFrame) -> pd.DataFrame:
    weather.sort_values(by='recordDate',inplace=True)
    filter = (weather['recordDate'].diff().dt.days == 1) & (weather['temperature'].diff()>0)
    return weather.loc[filter,['id']]

   id
1   2
3   4

Average Time of Process per Machine

Solution 1

In [22]:
data = [[0, 0, 'start', 0.712], [0, 0, 'end', 1.52], [0, 1, 'start', 3.14], [0, 1, 'end', 4.12], [1, 0, 'start', 0.55], [1, 0, 'end', 1.55], [1, 1, 'start', 0.43], [1, 1, 'end', 1.42], [2, 0, 'start', 4.1], [2, 0, 'end', 4.512], [2, 1, 'start', 2.5], [2, 1, 'end', 5]]
activity = pd.DataFrame(data, columns=['machine_id', 'process_id', 'activity_type', 'timestamp']).astype({'machine_id':'Int64', 'process_id':'Int64', 'activity_type':'object', 'timestamp':'Float64'})

def get_average_time(activity: pd.DataFrame) -> pd.DataFrame:
    activity_pivot = activity.pivot(index=['machine_id', 'process_id'],columns='activity_type',values='timestamp').reset_index()
    activity_pivot['processing_time'] = activity_pivot['end'] - activity_pivot['start']
    activity_pivot = activity_pivot.groupby(['machine_id']).agg({'processing_time':'mean'}).reset_index()
    activity_pivot = activity_pivot[['machine_id', 'processing_time']].round(3)

    return activity_pivot